## [Terraform Plan Summary]
| 항목            | 값 |
|-----------------|-----|
| **Status**      | `success` |
| **Directory**   | `stage-team-account/OIDC/iam`  |
| **Executed At** | `2025-07-11 16:04:48 UTC` |


---

### Plan Output
```hcl
[command]/home/runner/work/_temp/376b0ece-e0e0-48fa-b0d5-6c813d37fb30/terraform-bin show -no-color tfplan.binary

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.github_oidc.aws_iam_openid_connect_provider.github will be created
  + resource "aws_iam_openid_connect_provider" "github" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = [
          + "6938fd4d98bab03faadb97b34396831e3780aea1",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # module.github_oidc.aws_iam_role.oidc_role will be updated in-place
  ~ resource "aws_iam_role" "oidc_role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          - StringLike   = {
                              - "token.actions.githubusercontent.com:sub" = [
                                  - "repo:WHS-DevSecOps-infra/Organization:*",
                                  - "repo:WHS-DevSecOps-infra/Application-Deployment:*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::929368846645:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - description           = "cicd" -> null
        id                    = "Application-deployment-role3"
        name                  = "Application-deployment-role3"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.github_oidc.aws_iam_role_policy_attachment.attach_policy["arn:aws:iam::aws:policy/AdministratorAccess"] will be created
  + resource "aws_iam_role_policy_attachment" "attach_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "Application-deployment-role3"
    }

Plan: 2 to add, 1 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # module.github_oidc.aws_iam_openid_connect_provider.github will be created%0A  + resource "aws_iam_openid_connect_provider" "github" {%0A      + arn             = (known after apply)%0A      + client_id_list  = [%0A          + "sts.amazonaws.com",%0A        ]%0A      + id              = (known after apply)%0A      + tags_all        = (known after apply)%0A      + thumbprint_list = [%0A          + "6938fd4d98bab03faadb97b34396831e3780aea1",%0A        ]%0A      + url             = "https://token.actions.githubusercontent.com"%0A    }%0A%0A  # module.github_oidc.aws_iam_role.oidc_role will be updated in-place%0A  ~ resource "aws_iam_role" "oidc_role" {%0A      ~ assume_role_policy    = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = "sts:AssumeRoleWithWebIdentity"%0A                      - Condition = {%0A                          - StringEquals = {%0A                              - "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"%0A                            }%0A                          - StringLike   = {%0A                              - "token.actions.githubusercontent.com:sub" = [%0A                                  - "repo:WHS-DevSecOps-infra/Organization:*",%0A                                  - "repo:WHS-DevSecOps-infra/Application-Deployment:*",%0A                                ]%0A                            }%0A                        }%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - Federated = "arn:aws:iam::929368846645:oidc-provider/token.actions.githubusercontent.com"%0A                        }%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> (known after apply)%0A      - description           = "cicd" -> null%0A        id                    = "Application-deployment-role3"%0A        name                  = "Application-deployment-role3"%0A        tags                  = {}%0A        # (8 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.github_oidc.aws_iam_role_policy_attachment.attach_policy["arn:aws:iam::aws:policy/AdministratorAccess"] will be created%0A  + resource "aws_iam_role_policy_attachment" "attach_policy" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"%0A      + role       = "Application-deployment-role3"%0A    }%0A%0APlan: 2 to add, 1 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # module.github_oidc.aws_iam_openid_connect_provider.github will be created%0A  + resource "aws_iam_openid_connect_provider" "github" {%0A      + arn             = (known after apply)%0A      + client_id_list  = [%0A          + "sts.amazonaws.com",%0A        ]%0A      + id              = (known after apply)%0A      + tags_all        = (known after apply)%0A      + thumbprint_list = [%0A          + "6938fd4d98bab03faadb97b34396831e3780aea1",%0A        ]%0A      + url             = "https://token.actions.githubusercontent.com"%0A    }%0A%0A  # module.github_oidc.aws_iam_role.oidc_role will be updated in-place%0A  ~ resource "aws_iam_role" "oidc_role" {%0A      ~ assume_role_policy    = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = "sts:AssumeRoleWithWebIdentity"%0A                      - Condition = {%0A                          - StringEquals = {%0A                              - "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"%0A                            }%0A                          - StringLike   = {%0A                              - "token.actions.githubusercontent.com:sub" = [%0A                                  - "repo:WHS-DevSecOps-infra/Organization:*",%0A                                  - "repo:WHS-DevSecOps-infra/Application-Deployment:*",%0A                                ]%0A                            }%0A                        }%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - Federated = "arn:aws:iam::929368846645:oidc-provider/token.actions.githubusercontent.com"%0A                        }%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> (known after apply)%0A      - description           = "cicd" -> null%0A        id                    = "Application-deployment-role3"%0A        name                  = "Application-deployment-role3"%0A        tags                  = {}%0A        # (8 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.github_oidc.aws_iam_role_policy_attachment.attach_policy["arn:aws:iam::aws:policy/AdministratorAccess"] will be created%0A  + resource "aws_iam_role_policy_attachment" "attach_policy" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"%0A      + role       = "Application-deployment-role3"%0A    }%0A%0APlan: 2 to add, 1 to change, 0 to destroy.%0A

::set-output name=stderr::

::set-output name=exitcode::0
```